### <center> Titanic

In [1]:
import pandas as pd
import numpy as np

In [2]:
from google.colab import drive
drive.mount('/content/drive')
df = pd.read_csv('drive/My Drive/titanic.csv')
df.head()

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

1. Сколько всего ячеек в полученном датафрейме?

In [3]:
df.size

10692

2. Сколько строк в датафрейме?

In [4]:
df.shape

(891, 12)

3. Сколько в датафрейме столбцов типа данных float64?

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

3. Найдите возраст самого младшего и самого старшего пассажира

In [6]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [7]:
print(df['Age'].max())
print(df['Age'].min())

80.0
0.42

4. Найдите пассажира с id равным 200. Сколько ему лет?

In [8]:
df[df["PassengerId"] == 200]

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
199          200         0       2  ...  13.0   NaN         S

[1 rows x 12 columns]

5. Титаник затонул в 1912 году. Рассчитайте, сколько лет должно быть сегодня всем выжившим пассажирам. Выберите, сколько лет должно быть пассажиру с пассажирским id, равным 311?

In [9]:
#df[df['Survived']==1]["Age"] + pd.datetime.now().year-1912 - для расчёта количества лет всем выживших в текущем году. 
#df[df['Survived']==1]["Age"] + (2021-1912) - для расчёта количества лет всем выживших в текущем году способ для будущих версий, т.к. pd.datetime будет удалён в будущих версиях
df_alive = df[df['Survived']==1]
df_alive[df_alive['PassengerId'] == 311]["Age"] + pd.datetime.now().year-1912

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:4: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  after removing the cwd from sys.path.

310    133.0
Name: Age, dtype: float64

6. В начале 20 века один фунт стерлингов стоил 9,46 рублей. Пересчитайте для всех пассажиров, сколько бы стоил билет на Титаник в рублях. Сколько в рублях стоил билет пассажира с PassengerId 248

In [10]:
#df['Fare'] * 9.46 - пересчёт цены билетов в рублях для всех пассажиров
df[df['PassengerId']==248]['Fare'] * 9.46

247    137.17
Name: Fare, dtype: float64

In [11]:
df[245:250]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
245          246         0       1  ...  90.0000   C78         Q
246          247         0       3  ...   7.7750   NaN         S
247          248         1       2  ...  14.5000   NaN         S
248          249         1       1  ...  52.5542   D35         S
249          250         0       2  ...  26.0000   NaN         S

[5 rows x 12 columns]

7. Какое количество пассажиров было старше 25, но младше 35 лет (не включайте пассажиров в возрасте 25 и 35)?

In [12]:
df[(df['Age']>25) & (df['Age']<35)]['Age'].count()

178

8. Какое количество женщин было в возрасте от 45 лет и выше (включая женщин 45 лет)?

In [13]:
df[(df['Sex'] == 'female') & (df['Age']>=45)]['Age'].count()

36

9. Сколько человек купили билеты первого и второго классов?

In [14]:
df[(df['Pclass'] == 1) | (df['Pclass'] == 2)]['Pclass'].count()

400

10. Используя группировку найти средний возраст мужчин и женщин

In [15]:
#df.groupby('Sex')['Age'].mean()
df.groupby('Sex')[['Age']].mean() #Покрасивее =)

              Age
Sex
female  27.915709
male    30.726645

11. Используя группировку найти максимальный возраст поссажира в каждом классе

In [16]:
df.groupby('Pclass')[['Age']].max()

         Age
Pclass
1       80.0
2       70.0
3       74.0

12. Выбрать следующий срез данных: с 100 по 139 индекс, со столбца PassengerId по Fare. По выбранному срезу найти среднюю стоимость билета

In [17]:
df.loc[100:140, 'PassengerId':'Fare']['Fare'].mean()

26.907209756097554

13. По выбранному выше срезу данный найти, сколько человек купили билеты первого класса

In [18]:
srez = df.loc[100:140, 'PassengerId':'Fare']
srez[srez['Pclass']==1]['Pclass'].count()

7

14. В каких из перечисленных столбцов есть пропущенные значения (NaN)?

In [19]:
df.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

15. Найти количество пропущенных значений в столбцe Age

In [20]:
df['Age'].isna().sum()

177

16. Заполните пропущенные значения в столбце Age нулем и пересчитайте средний возраст пассажиров, чему он теперь равен (значение округлить до целого)?

In [21]:
df['Age'].fillna(0).mean()

23.79929292929293

17. Считайте данные из файла embarking_town.xlsx. Данные предсавляют собой справочник городов отправления и содержат два столбца: шифр города (Embarking_id) и название города (Embarking_town). В датасете titanic указан только шифр города. Добавьте название города в датасет. Используйте функцию merge для объединения данных. Сколько строк у полученного датафрема?

In [22]:
from google.colab import drive
drive.mount('/content/drive')
df_town = pd.read_excel('drive/My Drive/embarking_town.xlsx')
df_town.head()

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

  Embarking_id Embarking_town
0            S    Southampton
1            C      Cherbourg
2            Q     Queenstown
3            L      Lusitania

In [23]:
df_town_rename = df_town.rename(columns={'Embarking_id':'Embarked'})
df_town_rename

  Embarked Embarking_town
0        S    Southampton
1        C      Cherbourg
2        Q     Queenstown
3        L      Lusitania

In [24]:
df_full = df.merge(df_town_rename, on = 'Embarked', how = 'left')
df_full

     PassengerId  Survived  Pclass  ... Cabin Embarked  Embarking_town
0              1         0       3  ...   NaN        S     Southampton
1              2         1       1  ...   C85        C       Cherbourg
2              3         1       3  ...   NaN        S     Southampton
3              4         1       1  ...  C123        S     Southampton
4              5         0       3  ...   NaN        S     Southampton
..           ...       ...     ...  ...   ...      ...             ...
886          887         0       2  ...   NaN        S     Southampton
887          888         1       1  ...   B42        S     Southampton
888          889         0       3  ...   NaN        S     Southampton
889          890         1       1  ...  C148        C       Cherbourg
890          891         0       3  ...   NaN        Q      Queenstown

[891 rows x 13 columns]

In [25]:
df_full.shape

(891, 13)

In [26]:
df_full['Embarking_town'].unique()

array(['Southampton', 'Cherbourg', 'Queenstown', nan], dtype=object)